{
  "data": [
    {
      "title": "Software Engineering Manager  - Design Import, Remote AU/NZ",
      "description": " Software Engineering Manager (backend) - Design Import, Remote AU/NZ Sydney, New South Wales, Australia / Engineering - Leadership / Full-time Apply...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-08-02T17:00:07.300Z",
      "expiry_date": "2022-08-24T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304828305"
    },
    {
      "title": "Integration Engineer - Remote - Permanent",
      "description": " Integration Engineer at exciting start-up - Remote - Permanent    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.        Your new role:   \n \n Lead the development of complex software integrations end-to-end \n Analyse and model data architecture \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n      \n What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Significant experience working with .NET, Python, Typescript & Go \n Understanding of modern integration patterns utilised with Serverless, Event \n Driven systems. \n Integration platforms e.g. Boomi, MuleSoft, Jitterbit \n Database experience e.g. Oracle, MS SQL or MongoDB \n Integration Engineer 3 \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:07:02.363Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859375"
    },
    {
      "title": "Tech Lead - ANZ - Oceania",
      "description": "KEY DUTIES/RESPONSIBILITIES:\n\nAs a Site Tech Leader, you must be able to lead and provide guidance and supervision to technical support team members from different countries based in Australia, Indonesia, Japan and South Korea and New Zealand as a dispatch site. Strong leadership and communication skills.Strong technical skills supporting user environment, desktop, servers and networking.Must be able to work in a fast phase environment of diverse cultures.Able to work with remote teams based in India, US and Europe providing level 3 support in EUC, Servers and Networking to Oceania businesses.\n\nRoles & Responsibilities\n\nProvide technical support as a point of contact for IT for the site.\nEnd-user desktop, laptops, office IT with smart hand support for network and servers.\nInstallation support for various software on end-user systems and servers when required\nNew users onboarding preparing IT assets and tools.\nOffboarding support, collecting IT assets and sanitizing IT assets and keep in stock.\nExecutive / VIP support.\nCoordination and remote hand support to backend team for Network & server smart hand support.\nIP phone, Video conference support, Level 1 Multifunction Printers support.\nCoordinate external vendors when engaged for support.\nWork independently and coordinate in-house IT projects.\nThe engineer should manage most of their time around activities involving BAUs - SLAs, CSAT, Response Time to Client, Average Resolution time, Open incident backlog and maintaining SOP’s and Runbooks for global team use\nShould provide technical guidance to Site Tech, prioritization on workload and resource capacity planning\nShould be leading the project support team\nAsset / stock management / E-Waste, Site Tech Onboarding / Training / Process alignment / Documentation , Onsite Training / User Education , Vendor Co-ordination\nSelf-disciplined and highly motivated.\nGood decision-making skills \nShould be able to prioritise workload based on SLA’s and user impact. \nConfiguring, deploying, and troubleshooting enterprise and personal desktop and laptop computers, personal productivity devices, and business applications.\nSupporting midrange servers.\nSupporting network devices such as switches, routers, and Wireless Apps with the help of the backend team.\nHanding tickets on ServiceNow or a similar ticketing system.\nTroubleshooting VPN.\nApplication support with Microsoft Office (Outlook, Word, Excel, and PowerPoint) and SharePoint.\nTroubleshooting MS Windows 10.\nTroubleshooting MS Office 365 issues for end-users.\nOffice IT Asset Management.\nDESIRED SKILLS & EXPERIENCE\n\n 7+ years experience in IT supports demonstrating increasing responsibility and technical expertise in a corporate enterprise environment.\nIn-depth knowledge of Microsoft Windows 7 and Windows 10 operating systems and their related remote access.\nKnowledge & experience with ServiceNow or similar ticketing system.\nUnderstanding of Active Directory.\nFamiliarity with Microsoft server technologies and their associated user management tools, including Active Directory, Office 365, SharePoint, File, Print, DHCP, and DNS.",
      "posted": "2022-07-20T12:01:52.360Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "AVASO Technology Solutions Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Northern Sydney & Central Coast",
      "area": "LANE COVE NORTH",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304248995"
    },
    {
      "title": "Full-Stack Developer - Remote",
      "description": " Full-Stack Developer - Remote - FinTech    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.      Your new role:   \n \n Lead the development of full-stack applications from design through to production release \n Connect platforms through API orchestration to improve on customer experience \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n     What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Front-end experience with Typescript, JavaScript, HTML \n Significant experience working with server-side languages e.g. .NET, Python, Typescript & Go \n Frameworks such as React, Vue or Svelte \n Familiarity with API Development and database experience e.g. Oracle, MS SQL or MongoDB \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:43:04.580Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859515"
    },
    {
      "title": "Senior Software Engineer  - Open to remote across ANZ",
      "description": " Senior Software Engineer (Python) - Open to remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure / Full-time Apply for...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-30T19:55:05.793Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304676771"
    },
    {
      "title": "Senior Software Engineer  - AWS / Terraform / DevOps ",
      "description": " Senior Software Engineer (Python / Golang) - AWS / Terraform / DevOps (remote) Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304711028"
    },
    {
      "title": "Software Engineer  - AWS/Kubernetes/Devops - Open for Remote across ANZ",
      "description": " Software Engineer (Python) - AWS/Kubernetes/Devops - Open for Remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304741192"
    },
    {
      "title": "Full Time Computer Network and Systems Engineer",
      "description": "Business name: ONCALL Language Services Pty Ltd\nBusiness Address: Level 2, 150 Albert Road, South Melbourne, VIC – 3205\n\nPosition Title: Full Time Computer Network and Systems Engineer\nSalary: $62,000 plus superannuation \n\nTasks include:\n\n•\tInvestigate, troubleshoot, maintain and control the use of networks (LAN/WAN), servers, workstations, and peripheral devices. \n•\tInvestigate, install, configure, test and upgrade hardware and software applications, including network equipment. \n•\tInstall, configure, maintain and control Network Printers and Scanners, Routers and Switches for the smooth business operation.\n•\tDaily monitor and control performances of computer systems and networks.\n•\tInstall, implement and monitor network traffic and security \n•\tProvide necessary support by installing, configuring and providing support for Remote access to the team.\n•\tProvide remote/onsite troubleshooting and resolving the issues to internal office staffs and clients as per necessity.\n•\tWork together with the team to evaluate and resolve daily issues.\n•\tMonitor and control the use of email, web navigation and installed software applications.\n•\tInstall, configure, maintain and monitor routine backup of servers, virtual machines and databases.\n•\tMonitor Firewalls, Routers, Switches, Access points and Cabling for smooth operation of business\n•\tAdministration and management of servers, VMs, workstations and other software applications.\n•\tPrepare and maintain the procedure and documentation for network inventory and recording IT and network incidents, their diagnosis and resolutions.\n•\tProvide critical analysis and problem-solving suggestions to the team, clients and interpreters whenever required.\n•\tParticipate, provide critical analysis and contribute in various IT projects.\n•\tInstall, test, monitor, and pack interpreting equipment and transport the equipment and booths.\n•\tResponsible for keeping interpreting equipment clean, safe and organised.\n\nSkills Required:\n•\tRelevant Bachelors or Master Degree \n•\tMinimum three years of relevant work experience\n•\tDeep understanding in Wire and Wireless controllers, Access points, WPA2,\n•\tProven experience working in a Systems Administration Assitant / Level 2 Support role preferably within an MSP environment\n•\tAdvanced knowledge of Active Directory, Group Policies, DNS, DHCP and Windows 2012 through 2019\n•\tExperience in Office 365, Azure and AWS administration is desirable.\n•\tExcellent knowledge of Networking technologies (switching, routing, VLAN, WLAN, WAN, VPN)\n•\tMaintaining software updates and version consistency\n•\tExperience handling large conferences is an added advantage \n•\tKnowledge in Wireless and Infrared technologies and equipments\n•\tExcellent Hands -on knowledge of virtualization is essential (VMware, HyperV, Vsphere preferred)\n•\tExperience with VOIP tools, online teplohny system (3CX preferred)\n•\tExperience in firewall both hardware and software (pfsense prefrred)\n•\tExcellent troubleshooting and resolving ability\n•\tExperience in regular back up of VMs and Online applications (VEEAM and Handy backup – preferred)\n\n\nPlease send your CV to info@businessnest.com.au",
      "posted": "2022-08-11T11:23:21.043Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Business Nest",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "SOUTH MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871870"
    },
    {
      "title": "Field Technician",
      "description": "The Field Technician is a company representative at various Client sites within the Australasia region providing training and technical expertise, maintenance and repairs and support of GroundProbe’s products both locally and globally in surface and underground mining environments.\n\nResponsibilities\n1.\tWork safely, and with regard to the safety of others, including: \na.\tCompliance with all WHS policies and procedures, and\nb.\tActively work to improve safety in the workplace\n2.\tInstall and integrate GroundProbe’s products as required for Customers;\n3.\tCommission and decommission GroundProbe’s products;\n4.\tOrganise and perform external demonstrations on GroundProbe’s products;\n5.\tFollow up on demonstrations to ensure successful outcome for Customers and GroundProbe;\n6.\tTrain technical specialist team on deployment, operation and maintenance of GroundProbe’s products;\n7.\tManage few customer accounts with technical and operational aspect and build strong relationship with customer\n8.\tMonitor and present GroundProbe’s products data;\n9.\tProvide on-site training and technical support to Customers;\n10.\tMaintain GroundProbe’s products minimising downtime and meeting Customer needs;\n11.\tPerform technical support work on GroundProbe technologies at remote sites and from GroundProbe’s office;\n12.\tAssist with marketing and development of a positive image of GroundProbe, its technologies and its employees.\n\nQualifications\n•\tTertiary qualifications or relevant experience in Electrical, Mechanical or Electronic discipline(s);\n•\tExtensive relevant technical work experience in a customer service based organisation;\n•\tExperience in electronics, radar, telecommunications or a related field;\n•\tExperience, proven potential, or a track record of success in a comparable role, doing comparable work.\n•\tAbility to train individuals and small groups;\n•\tMechanical knowledge is desirable.\n•\tMining environment/remote location experience is desirable;\n•\tComputer literacy especially in MS Office;\n•\tUnencumbered Manual Drivers Licence;\n•\tAbility to obtain national police clearance certificate for work at mine sites;\n•\tAbility to pass ongoing Pre-employment medical assessments including drug and alcohol tests for site access.\n\nSalary offer:  The annual salary for this position is $90,000 plus superannuation.\n\nWhat we offer\n\nAs part of a truly global company, you will have the ability to grow and learn in a diverse, collaborative culture. We foster relationships and learning through connected global and local teams, promote flexible and diverse career paths and support the development of your knowledge and skills. \n\nYou will be paid a competitive salary, learn from talented individuals across multiple disciplines and be able to thrive in a safe workplace within a collaborative culture. Ignite your career at a place where your distinct potential can find its home.\n\nOur commitment\n\nGroundProbe promotes and fosters a culture of inclusion and Equal Opportunity Employment everywhere we operate. We treat our people and applicants with fairness, dignity, and respect, getting the best of everyone’s contributions.\n\nAll qualified applicants will receive consideration for employment without regard to race, religion, sexual orientation, gender perception or identity, nationality, age, military or veteran, marital or disability status.",
      "posted": "2022-07-21T15:09:12.957Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "GroundProbe Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "WINDSOR",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304307233"
    },
    {
      "title": "Business Process Consultant",
      "description": "Enable is a pure-play ServiceNow consultancy—100% dedicated to the delivery of ServiceNow advisory, consulting and delivery services. With more than 250 consultants in our ServiceNow practice, we’re the most qualified, certified and capable ServiceNow partner in the APJ region.  \n\n  Our focus is enterprise service management, and we have deep knowledge of and experience in digital and business transformation. Enable has dedicated practices in Customer Service Experience, IT Transformation, Employee Service Experience and Integrated Risk Management. We also have Innovation and Organisational Change Management practices that are intrinsic to everything we do.  \n\n  We are headquartered in Australia, with offices in Singapore, Hong Kong, Thailand, Malaysia, and our centre of excellence in India.   \n\n  Role Summary:  \n\n Consulting roles are exciting and challenging - our customer base ranges across all tier 1 industries and sizes. Engagements vary in length from days to months to years. To be successful in this role, you must present excellent communication skills to work with client stakeholders, client teams and Enablers - both local and remote. You should expect to engage with various clients from commercial to enterprise and have the ability to switch context and customers easily. \n\n  Main Responsibilities:  \n\n \n\t Leveraging Business Consulting Practice methodologies and consulting intellectual property to achieve business objectives. \n\t Drive high-level specific process definition, re-engineering, improvement and gap analysis of current/to-be processes. \n\t Preparing and running functional and technical design workshops \n\t Ensuring process-related deliverables to customers are complete, consistent, high quality, on time and deliver valued outcomes. \n\t Ownership for completing, developing, and improving required documentation such as process flow diagrams, solutions designs, as-built documentation, roles/responsibilities, workshop agendas, presentations, and gap analysis reports. \n\t Documenting user stories with acute attention to detail, reviewing with stakeholders, gaining acceptance criteria and managing stories throughout the development lifecycle with local and remote teams. \n \n\n  Skills Matrix:  \n\n \n\t 2 years of demonstrated experience across process consulting, definition and deployment of process improvement and systems analysis on ServiceNow platform. \n\t Requirements gathering, including experience in creating process documentation, solution designs and detailed requirements. \n\t Experience designing process flows for ServiceNow applications \n\t Domain expertise in IT Service Management. \n\t Experience using ServiceNow Agile Development and managing SCRUM calls and Agile processes. \n \n\n  Qualifications & Certifications:  \n\n ·        IT Degree or relevant tertiary education in Computer Science \n\n ·        ServiceNow CSA + CIS ITSM \n\n ·        ITIL Foundation Certified \n\n ·        PMP and/or Agile Scrum certificates",
      "posted": "2022-08-15T11:49:58.337Z",
      "expiry_date": "2022-09-16T00:00:00.000Z",
      "organisation": "Enable Professional Services",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304876905"
    },
    {
      "title": "Technical Support Specialist: Printing",
      "description": "GJS is a dynamic, Australian-owned business headquartered in Revesby and we’re currently looking for an experienced, self-motivated and customer-focused person to join our support team as a Technical Support Specialist in Queensland.\n\nWe have a passion for our people and are proud of our fast-paced, high-energy, team-orientated environment, so to land this role you’ll need to have the following skills:\n\n- Previous experience servicing and supporting digital equipment\n- Background in electronics\n- Valid driver’s licence\n- Excellent verbal communication and customer service skills\n- Highly organised, efficient time management and reliable\n- High attention to detail and quality focus\n- Professional personal presentation\n- Familiarity with Microsoft Office Suite\n\n**Bonus points if you also have**\n\n- Previous experience within the digital printer market\n- Familiarity with Salesforce Service Cloud/Field Service Lightning\n- Familiarity with SAP Business One\n- Familiarity with Adobe Creative Suite of graphics software\n\nWhat you’ll be doing each day:\n- Providing remote and/or on-site technical support to ensure GJS customers can enjoy maximum up-time and production\n- Hitting the road and installing new printing equipment\n- Remote and on-site product training for GJS customers\n- On-site scheduled servicing of existing GJS printer install base\n- Assisting the sales and customer services teams in maintaining GJS' exceptional customer service standards\n- Develop and maintain all support and service process documentation and the GJS knowledgebase\n\nThe perks!\n-  Competitive salary and benefits\n-  Work for a funky, dynamic business that embraces new technology and is disrupting its industry\n- Young management with progressive ideas\n- All product training provided\n- Immediate start\n\nWorking Hours:\n- Monday to Friday: 8am?4.30pm\n\nGJS is a fun, supportive and equal opportunity employer where we are giving the right person the opportunity to be trained, learn about our exciting industry and become part of our vibrant, energetic and growing team.\n\nHow to apply:\nIf this is you, then please submit a copy of your CV with an accompanying cover letter detailing how your professional experience makes you the best choice for this role and also answers the following questions:\n\n- If you were a cocktail, what would you be and why?\n\nOnly applications with accompanying cover letters that answer the above questions will be considered.\n\nSalary: $50,000.00 – $65,000.00 per year + vehicle allowance",
      "posted": "2022-08-04T11:52:43.463Z",
      "expiry_date": "2022-09-05T00:00:00.000Z",
      "organisation": "GJS GROUP AUSTRALIA PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "BRISBANE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859779"
    },
    {
      "title": "DevOps Engineer",
      "description": "Responsibilities include:\n•\tSolve complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks. \n•\tWrite/maintain code for custom infrastructure services \n•\tDesign machine learning systems and self-running artificial intelligence (AI) software to automate predictive models. \n•\tDesign, review, and present technical infrastructure solutions to solve business use cases \n•\tWork with clients to gather and documents technical requirements\n•\tDocument and showcase technical features or fixes \n•\tTransform data science prototypes and applying appropriate ML algorithms and tools. \n\nWork experience required  \n•\tSkilled in Python (Programming Language), C++, Java, Microsoft Products, and .NET Framework. \n•\tStrong software engineering skills \n•\tSuperb analytical and problem-solving abilities. \n•\tStrong DevOps skills (preferably with Microsoft Azure Devops)\n•\tGreat communication and collaboration skills. \n•\tExcellent time management and organisational abilities. \n•\tStrong cloud skills (preferably with Microsoft Azure) \n•\tDocumentation skills\n•\tExperience working in an Agile environment \n\nSalary $80,000 - $100,000 p/a\nPermanent Position\nLocation – Melbourne remote",
      "posted": "2022-08-11T10:44:35.213Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871731"
    },
    {
      "title": "Node/React Developer",
      "description": "Milestone IT is a recognised leader in the recruitment and employment of high-quality software engineers. Right now, we have an exciting opportunity for an experienced developer to join our team. \n\nAbout you\nApplicants must be able to demonstrate the following key capabilities and behaviours:\nStrong JavaScript (ES6/7) development experience with ReactJS and NodeJS. \nPrior experience with databases (e.g. MySQL, Postgres)\nPrior experience with GraphQL development experience is a plus.\nPrior experience with any message-queueing (e.g. RabbitMQ, Kafka)\nPrior experience with a JavaScript testing framework such as Jest.\nPrior experience with microservices architectures and containerisation, including good knowledge of Docker.\nStrong critical thinking skills, an analytical mindset and outstanding attention to detail.\nAbility to work efficiently with remote teams using collaboration technology.\nAbility to identify issues and solve complex problems as part of a team.\nAbility to remain calm when under pressure and meet demanding deadlines.\nGood written and verbal communication skills.\nA proactive approach to resolving problems.\nKnowledge of agile software development lifecycles (SDLC) and experience working on projects that follow an Agile Scrum methodology.\nKnowledge of proper source code management and the use of Git repositories.",
      "posted": "2022-08-18T11:56:07.523Z",
      "expiry_date": "2022-09-19T00:00:00.000Z",
      "organisation": "MILESTONE INFORMATION TECHNOLOGY PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "DOCKLANDS",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304884356"
    },
    {
      "title": "Technical Lead - Performance",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to lead a team in our Careers camp working on our Performance product. This camp has multiple teams tasked with creating transformative people-first performance reviews that are growth focussed, fair and equitable, and inspire action. Captured in a platform that is easy to use, connected and scalable.\n\nYour role will be to provide confident technical and people leadership, empowering and enabling your engineers to achieve a high standard of technical excellence. You will be working both hands-on and hands-off, guiding outcomes that align towards our technical vision, coaching the team towards robust system architecture, their technology choices, implementation details, and product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team to craft and share compelling solutions with peers and stakeholders\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously led a high performance engineering team and worked closely with other leaders\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate and draw intelligent conclusions\nExperience working across the stack and not perturbed by legacy systems\nYou are...\n\nAn empathetic people leader who can naturally balance hands-on tasks and coaching individuals\nA passionate supporter of high quality, scaleable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:49:11.290Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198775"
    },
    {
      "title": "Systems Support Consultant ",
      "description": "Systemnet is an unique IT infrastructure services company based in Sydney. \nSystemnet, together with our partners, are dedicated to providing our clients with an effective, efficient and responsive outsourced IT infrastructure service and innovative solutions. \n\nSystemnet prides itself with the relationships it has fostered over the last 25 years with its clients, suppliers and team members. We aim to provide you with a challenging and rewarding environment, in which you may develop your professional skills and simultaneously enhance the success of Systemnet, its team and our clients. \n\nSystemnet is not product centric and will evaluate all options when recommending solutions to our clients. This creates an opportunity for you to explore new ideas and introduce these new solutions to the business.\n\nAbout the role: \n\nThe focus is on business IT systems and the responsibilities include design, implementation, maintenance and support of Local Area and Wide Area networks.\n\nYou will:\n\nProvide Managed IT Services to corporate clients across a broad range of industry sectors. Your support will be offered remotely and onsite.\nYou will be working on exciting implementation projects which will involve ‘on premises’ and/or cloud installations and migrations.\nDesign new LAN and WAN IT system configurations.\nResearch and utilising your analytical skills evaluate the performance of operational environments with the objective of improving performance, security and redundancy.\nDocument and enforce Systemnet standards.\nMaximise network performance by monitoring performance and troubleshooting problems and outages on the local and wide area network.\nUsing Network monitoring and analysis tools from SolarWinds use your skills and experience to identify, evaluate and resolve issues quickly and efficiently,\nSchedule and manage system software upgrades and patch management of core devices.\nUtilising multiple sources for information, investigate and resolve network faults while communicating the status of the issues to the client and internal management.\nSecure network systems by establishing and enforcing security policies and implementation of security devices and software.\nMonitor, administer, upgrade and configure firewall environments.\nMonitor and ensure firmware on wide area network devices are up to date.\nManage a configuration of 60+ firewall clusters dispersed across the Asia Pacific region.\nConfiguration of routers and switching equipment for voice and data services.\nTelephone and on-site support/troubleshooting for customers and other Systemnet engineers.\nRemote technical support to local and international clients.\nHardware & Software Support\nLiaise with project managers, sales consultants, IT software and hardware vendors in order to deliver cost effective IT solutions.\nClient systems management\n\nBenefits and perks:\n\nGreat learning and career development opportunities\nInner city working environment\nTeam-focused environment\nFlexibility, eg working from home on certain days\n\nSkills and experience:\n\nIt is essential that you have excellent English oral and written communication skills.\nYou will need to be able to provide both remote and onsite support.\nYou must be able to interact confidently at all levels within an organisation.\nIT experience or relevant IT qualifications\nWorked with Server platforms\nKnowledge of Server Virtualisation technologies from Microsoft and VMWare\nFamiliarity with Cloud technologies such as Office 365, Azure and AWS\nWorked with disaster recovery products such as Veeam\nKnowledge of security technologies from vendors such as Watchguard and Cisco\nFamiliarity with all the usual network infrastructure technologies such as routers, switches, and Wi-Fi\nWillingness and ability to participate in a 24x7 phone support roster.\nYou will also need to have a valid visa to work and live in Australia",
      "posted": "2022-08-11T13:57:55.787Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "SYSTEMNET PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Eastern Sydney",
      "area": "BONDI JUNCTION",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872407"
    },
    {
      "title": "Desktop Support Engineer",
      "description": "Daily Mail Australia forms part of a phenomenal global offering attracting over 250 million readers world-wide across our award-winning newspapers, websites and apps - making it the world's largest English-speaking news website. We are consistently breaking exclusives in local and global news, celebrity, entertainment and sport while reporting on what's trending in fashion, beauty, health and technology.\n\nWe are looking for a Desktop Support Engineer to join our four-person team based in Sydney. You will act as the first point of contact for all technical related queries for all company users and apply your knowledge, logic and research techniques to solve technical issues. \n\nThe successful candidate will work remotely but there may be occasional travel required. \n\n\nKey Responsibilities:\n\nProviding 1st/2nd line support for onsite/remote users\nAnswering walk-ups, phone queries and emails from staff at all levels of the business\nSupporting VIP users including the Managing Editors office and the Editor\nAdministration of all company IT equipment including laptops, desktops and mobile devices\nAsset management of all company IT equipment\nEnsuring support team SLA’s are achieved\nUser account creation and access/role management\nBuild management, imaging and software deployments via SCCM 2012 and Jamf Pro\nLiaising with our global Tech teams to provide a high level of service to end users\nInvestigating and analysing incidents through to root cause\nEnsuring internal Daily Mail applications achieve maximum uptime, availability and performance\nProviding support and training of both bespoke and off the shelf applications\nMonitoring and implementing IT security policies\nDeploying/upgrading hardware and software as required\nMaintaining a strong working relationship with all external partners, vendors and internal teams\nMaintaining working knowledge of all computer related systems and software to facilitate troubleshooting and repairs\nCreation and management of technical documentation\nKeeping abreast of new computer-related technology that will assist Daily Mail Australia\nAttending training courses when required to do so\nManaging your time effectively under pressure\nPerforming other related duties as required\n\nKey Skills/Qualifications\n\nHardware/software installation and troubleshooting\nRemote support software (TeamViewer, LogMeIn, Splashtop, VNC)\nDemonstrable experience with supporting Windows and macOS operating systems\nExperience with ticket triaging and strong understanding of ticket management processes\nExperience working with Microsoft technologies (O365, Teams, SharePoint, OneDrive, Azure and Exchange)\nActive directory administration via Quest ActiveRoles Server/Azure AD\nSCCM 2012 image/software deployment\nExperience with Apple MDM tools (Jamf Pro)\nExperience with identity and access management solutions\nFTP software including Filezilla and SmartFTP\nBasic networking skills – TCP/IP, DNS, DHCP, VPNs\nExcellent documentation skills\nStrong written and oral communication skills and a keen attention for detail\n\nDesirable: \n\nExperience with Linux/Ubuntu operating systems\nMS security products (InTune, Defender, ATP)\nZendesk/Service Now ticketing systems\nAtlassian products (Jira/Confluence)\nVirtualisation technologies including VMWare, Parallels and Oracle VM Virtual Box\nExperience with CDN management (AWS/Akamai)\nHTML/CSS/SQL/Bash/Python\nUnderstanding of ITIL/Agile methodologies\n\nAnnual Base Salary between: $60,000 to $70,000 + Super",
      "posted": "2022-08-11T15:13:51.783Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "DAILYMAIL.COM AUSTRALIA PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872802"
    },
    {
      "title": "DevOps Engineer - Developer Platform  - Open to Remote across ANZ",
      "description": "At Canva, we’re transforming the way the world designs. Canva's user base has grown by over 10x over the last 2 years, and serves millions of users every single month, in over 100 languages, and across web and mobile platforms.  In order to ensure high availability, top-notch performance, and the continued scalability of the environment as Canva grows, we've decided to grow our Infrastructure Group.  We're seeking self-motivated and talented engineers to join us. \n\n   \n\n Stable, scalable, and well-maintained systems are the foundations of our development and design processes.  The developer efficiency team’s mission is to empower any engineer to develop and ship awesome features with the highest efficiency and quality.  We do this by building infrastructure tools and processes that facilitate the entire development life-cycle.  This includes our CI systems, build tools, IDE workflows, source control, and more.  The mission of this role is to maintain and improve our internal tools so that developers working at Canva have a delightful developer experience. \n\n   \n\n Responsibilities \n\n \n\t Work to improve/maintain internal developer experience platforms that empower engineers to work efficiently. \n\t Work across CI, Static Analysis Tooling, IDE Integration (Bazel) and other developer-related domains as necessary to ensure Canva’s engineering teams continue to scale with the demands of the product suite \n\t Develop self-service infrastructure from the ground up to empower our engineering teams to work more efficiently \n\t Communicate with other teams to figure out the best solutions to their problems \n\t Participate in design meetings, interviews, and code reviews \n\t Propose new approaches and solutions to ensure we future-proof Canva's distributed cloud infrastructure as we scale up \n\t Be invariably passionate about performance debugging, benchmarking, building awesome things, and picking up new technologies and skills \n \n\n Required Experience \n\n \n\t As a DevOps/ Software Engineer, have experience building internal tooling for CI, infrastructure, or developer efficiency/productivity \n\t Advanced coding proficiency in Python/ Java/golang  \n\t Experience with containers, Docker, Kubernetes \n\t An understanding of the DevOps ecosystem concerning tooling, Continuous Delivery, Continuous Integration, Infrastructure as Code \n\t Experience working in Linux cloud-based services in AWS, Google Cloud, or Azure \n\t Excellent verbal and written communication skills; strong soft skills when managing both technical and non-technical stakeholders \n\t Be self-motivated with a strong sense of ownership over complex problems and their related solutions",
      "posted": "2022-08-11T10:23:21.450Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Canva",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SURRY HILLS",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871636"
    },
    {
      "title": "Support Engineer",
      "description": "About the Company:\n5G Networks (5GN) is a licenced telecommunications carrier operating across Australia. Our vision is to be Australia’s partner of choice for unifying a seamless digital experience for our customers across data connectivity, cloud and data centre services, all underpinned by our expert managed services.\n\nThe Role\nAs a Support Engineer you will be responsible for providing fault resolution, escalation and maintenance services to our customers. Supporting them both onsite and remotely, you will install and maintain computer hardware, software and networks. Using your ability to develop relationships across the organisation, you'll provide support to clients across a wide range of platforms and technologies.\n\nWe are a lean and mean local team so you'll be working at full tilt most of the time, but you'll have a new challenge every day and will be a part of a national team of 100+ engineers.\n\nTitle: Support Engineer\nOccupation: ICT Support Engineer\nSalary: $65,000 - $79,999 (depending on experience) plus super \nCompany: Webcentral\nLocation: Melbourne\nHours: Full time 38 hours per week\nExperience Required: min 2 years in relevant role\nVisa Sponsorship: Nomination for temporary work visa and/or Permanent Residency will be considered for eligible candidates.\nDuties: Some of the duties you will be required to perform include\n•\tAssisting with fault escalation and resolution.\n•\tContribute to the delivery and documentation of customer projects.\n•\tConfigure, deploy and administer LAN, WAN, security and remote access technologies.\n•\tSupport customers with a wide variety of platforms and technologies.\n•\tBuild and configure desktops, servers and storage networking hardware.\n•\tProvide exceptional customer service.\n\nPLEASE NOTE: Only successful candidates will receive a reply. Applicants who contact the employer directly or submit applications outside of this online portal will not be considered.",
      "posted": "2022-08-09T16:37:27.383Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "George Migration Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868687"
    },
    {
      "title": "Technical Lead",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to support and grow our an Engineering Team, which sits within one of our Engineering Camps.\n\nYour role will be to help nurture and grow skilled engineers by coaching, mentoring and supporting your engineers. You will be working both hands-on and hands-off, with our technical vision as your target. You will coach your team to create world-class system architecture, make smart technology choices and deliver best-in-class product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team in crafting compelling solutions\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously helped lead a high performance engineering team\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate large or complex problems and decompose into smaller iterable components\nYou are...\n\nAn empathetic technical leader who can naturally balance hands-on tasks and coaching individuals\nAn avid supporter of high quality, scalable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:48:09.517Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198774"
    },
    {
      "title": "Business Analyst",
      "description": "Responsibilities:\n\nAnalyse and derive insights into current and future billing and pricing items within an End User Compute environment.\nProactively socialise with stakeholder groups and and assist with the development of strategies for optimisation/ consolidation, of price points and billing functionalities.\nProactively work with stakeholder groups billing strategies.\nEvaluate business processes, anticipate requirements, uncover areas for improvement, and develop and implement solutions.\nLead ongoing reviews of business processes and develop optimization strategies.\nAssist in Request For Proposal (RFP) Costing Analysis and supporting Business Case modelling\nDevelop policies, procedures and pricing tools for billing functionalities\nInput into the areas related to Asset & Billing\nCreation of detailed Modelled reporting to present to key stakeholders on pricing impacts.\n\n\n\n\nRequirements:\n\nA bachelor’s degree in business, technology or related field or equivalent experience.\nExceptional analytical and conceptual thinking skills.\nThe ability to influence stakeholders and work closely with them to determine acceptable solutions.\nExcellent documentation skills.\nFundamental analytical and conceptual thinking skills.\nExperience creating detailed reports and giving presentations.\nCompetency in Microsoft applications including Word, Excel, and Outlook.\nA track record of following through on commitments.\nExcellent planning, organisational, and time management skills.\nA history of supporting successful projects.\n\nLocation - Melbourne remote\nPermanent position",
      "posted": "2022-08-09T15:39:41.807Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868351"
    },
    {
      "title": "Software Engineering Manager  - Design Import, Remote AU/NZ",
      "description": " Software Engineering Manager (backend) - Design Import, Remote AU/NZ Sydney, New South Wales, Australia / Engineering - Leadership / Full-time Apply...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-08-02T17:00:07.300Z",
      "expiry_date": "2022-08-24T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304828305"
    },
    {
      "title": "Integration Engineer - Remote - Permanent",
      "description": " Integration Engineer at exciting start-up - Remote - Permanent    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.        Your new role:   \n \n Lead the development of complex software integrations end-to-end \n Analyse and model data architecture \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n      \n What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Significant experience working with .NET, Python, Typescript & Go \n Understanding of modern integration patterns utilised with Serverless, Event \n Driven systems. \n Integration platforms e.g. Boomi, MuleSoft, Jitterbit \n Database experience e.g. Oracle, MS SQL or MongoDB \n Integration Engineer 3 \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:07:02.363Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859375"
    },
    {
      "title": "Tech Lead - ANZ - Oceania",
      "description": "KEY DUTIES/RESPONSIBILITIES:\n\nAs a Site Tech Leader, you must be able to lead and provide guidance and supervision to technical support team members from different countries based in Australia, Indonesia, Japan and South Korea and New Zealand as a dispatch site. Strong leadership and communication skills.Strong technical skills supporting user environment, desktop, servers and networking.Must be able to work in a fast phase environment of diverse cultures.Able to work with remote teams based in India, US and Europe providing level 3 support in EUC, Servers and Networking to Oceania businesses.\n\nRoles & Responsibilities\n\nProvide technical support as a point of contact for IT for the site.\nEnd-user desktop, laptops, office IT with smart hand support for network and servers.\nInstallation support for various software on end-user systems and servers when required\nNew users onboarding preparing IT assets and tools.\nOffboarding support, collecting IT assets and sanitizing IT assets and keep in stock.\nExecutive / VIP support.\nCoordination and remote hand support to backend team for Network & server smart hand support.\nIP phone, Video conference support, Level 1 Multifunction Printers support.\nCoordinate external vendors when engaged for support.\nWork independently and coordinate in-house IT projects.\nThe engineer should manage most of their time around activities involving BAUs - SLAs, CSAT, Response Time to Client, Average Resolution time, Open incident backlog and maintaining SOP’s and Runbooks for global team use\nShould provide technical guidance to Site Tech, prioritization on workload and resource capacity planning\nShould be leading the project support team\nAsset / stock management / E-Waste, Site Tech Onboarding / Training / Process alignment / Documentation , Onsite Training / User Education , Vendor Co-ordination\nSelf-disciplined and highly motivated.\nGood decision-making skills \nShould be able to prioritise workload based on SLA’s and user impact. \nConfiguring, deploying, and troubleshooting enterprise and personal desktop and laptop computers, personal productivity devices, and business applications.\nSupporting midrange servers.\nSupporting network devices such as switches, routers, and Wireless Apps with the help of the backend team.\nHanding tickets on ServiceNow or a similar ticketing system.\nTroubleshooting VPN.\nApplication support with Microsoft Office (Outlook, Word, Excel, and PowerPoint) and SharePoint.\nTroubleshooting MS Windows 10.\nTroubleshooting MS Office 365 issues for end-users.\nOffice IT Asset Management.\nDESIRED SKILLS & EXPERIENCE\n\n 7+ years experience in IT supports demonstrating increasing responsibility and technical expertise in a corporate enterprise environment.\nIn-depth knowledge of Microsoft Windows 7 and Windows 10 operating systems and their related remote access.\nKnowledge & experience with ServiceNow or similar ticketing system.\nUnderstanding of Active Directory.\nFamiliarity with Microsoft server technologies and their associated user management tools, including Active Directory, Office 365, SharePoint, File, Print, DHCP, and DNS.",
      "posted": "2022-07-20T12:01:52.360Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "AVASO Technology Solutions Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Northern Sydney & Central Coast",
      "area": "LANE COVE NORTH",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304248995"
    },
    {
      "title": "Full-Stack Developer - Remote",
      "description": " Full-Stack Developer - Remote - FinTech    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.      Your new role:   \n \n Lead the development of full-stack applications from design through to production release \n Connect platforms through API orchestration to improve on customer experience \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n     What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Front-end experience with Typescript, JavaScript, HTML \n Significant experience working with server-side languages e.g. .NET, Python, Typescript & Go \n Frameworks such as React, Vue or Svelte \n Familiarity with API Development and database experience e.g. Oracle, MS SQL or MongoDB \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:43:04.580Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859515"
    },
    {
      "title": "Senior Software Engineer  - Open to remote across ANZ",
      "description": " Senior Software Engineer (Python) - Open to remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure / Full-time Apply for...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-30T19:55:05.793Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304676771"
    },
    {
      "title": "Senior Software Engineer  - AWS / Terraform / DevOps ",
      "description": " Senior Software Engineer (Python / Golang) - AWS / Terraform / DevOps (remote) Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304711028"
    },
    {
      "title": "Software Engineer  - AWS/Kubernetes/Devops - Open for Remote across ANZ",
      "description": " Software Engineer (Python) - AWS/Kubernetes/Devops - Open for Remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304741192"
    },
    {
      "title": "Full Time Computer Network and Systems Engineer",
      "description": "Business name: ONCALL Language Services Pty Ltd\nBusiness Address: Level 2, 150 Albert Road, South Melbourne, VIC – 3205\n\nPosition Title: Full Time Computer Network and Systems Engineer\nSalary: $62,000 plus superannuation \n\nTasks include:\n\n•\tInvestigate, troubleshoot, maintain and control the use of networks (LAN/WAN), servers, workstations, and peripheral devices. \n•\tInvestigate, install, configure, test and upgrade hardware and software applications, including network equipment. \n•\tInstall, configure, maintain and control Network Printers and Scanners, Routers and Switches for the smooth business operation.\n•\tDaily monitor and control performances of computer systems and networks.\n•\tInstall, implement and monitor network traffic and security \n•\tProvide necessary support by installing, configuring and providing support for Remote access to the team.\n•\tProvide remote/onsite troubleshooting and resolving the issues to internal office staffs and clients as per necessity.\n•\tWork together with the team to evaluate and resolve daily issues.\n•\tMonitor and control the use of email, web navigation and installed software applications.\n•\tInstall, configure, maintain and monitor routine backup of servers, virtual machines and databases.\n•\tMonitor Firewalls, Routers, Switches, Access points and Cabling for smooth operation of business\n•\tAdministration and management of servers, VMs, workstations and other software applications.\n•\tPrepare and maintain the procedure and documentation for network inventory and recording IT and network incidents, their diagnosis and resolutions.\n•\tProvide critical analysis and problem-solving suggestions to the team, clients and interpreters whenever required.\n•\tParticipate, provide critical analysis and contribute in various IT projects.\n•\tInstall, test, monitor, and pack interpreting equipment and transport the equipment and booths.\n•\tResponsible for keeping interpreting equipment clean, safe and organised.\n\nSkills Required:\n•\tRelevant Bachelors or Master Degree \n•\tMinimum three years of relevant work experience\n•\tDeep understanding in Wire and Wireless controllers, Access points, WPA2,\n•\tProven experience working in a Systems Administration Assitant / Level 2 Support role preferably within an MSP environment\n•\tAdvanced knowledge of Active Directory, Group Policies, DNS, DHCP and Windows 2012 through 2019\n•\tExperience in Office 365, Azure and AWS administration is desirable.\n•\tExcellent knowledge of Networking technologies (switching, routing, VLAN, WLAN, WAN, VPN)\n•\tMaintaining software updates and version consistency\n•\tExperience handling large conferences is an added advantage \n•\tKnowledge in Wireless and Infrared technologies and equipments\n•\tExcellent Hands -on knowledge of virtualization is essential (VMware, HyperV, Vsphere preferred)\n•\tExperience with VOIP tools, online teplohny system (3CX preferred)\n•\tExperience in firewall both hardware and software (pfsense prefrred)\n•\tExcellent troubleshooting and resolving ability\n•\tExperience in regular back up of VMs and Online applications (VEEAM and Handy backup – preferred)\n\n\nPlease send your CV to info@businessnest.com.au",
      "posted": "2022-08-11T11:23:21.043Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Business Nest",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "SOUTH MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871870"
    },
    {
      "title": "Field Technician",
      "description": "The Field Technician is a company representative at various Client sites within the Australasia region providing training and technical expertise, maintenance and repairs and support of GroundProbe’s products both locally and globally in surface and underground mining environments.\n\nResponsibilities\n1.\tWork safely, and with regard to the safety of others, including: \na.\tCompliance with all WHS policies and procedures, and\nb.\tActively work to improve safety in the workplace\n2.\tInstall and integrate GroundProbe’s products as required for Customers;\n3.\tCommission and decommission GroundProbe’s products;\n4.\tOrganise and perform external demonstrations on GroundProbe’s products;\n5.\tFollow up on demonstrations to ensure successful outcome for Customers and GroundProbe;\n6.\tTrain technical specialist team on deployment, operation and maintenance of GroundProbe’s products;\n7.\tManage few customer accounts with technical and operational aspect and build strong relationship with customer\n8.\tMonitor and present GroundProbe’s products data;\n9.\tProvide on-site training and technical support to Customers;\n10.\tMaintain GroundProbe’s products minimising downtime and meeting Customer needs;\n11.\tPerform technical support work on GroundProbe technologies at remote sites and from GroundProbe’s office;\n12.\tAssist with marketing and development of a positive image of GroundProbe, its technologies and its employees.\n\nQualifications\n•\tTertiary qualifications or relevant experience in Electrical, Mechanical or Electronic discipline(s);\n•\tExtensive relevant technical work experience in a customer service based organisation;\n•\tExperience in electronics, radar, telecommunications or a related field;\n•\tExperience, proven potential, or a track record of success in a comparable role, doing comparable work.\n•\tAbility to train individuals and small groups;\n•\tMechanical knowledge is desirable.\n•\tMining environment/remote location experience is desirable;\n•\tComputer literacy especially in MS Office;\n•\tUnencumbered Manual Drivers Licence;\n•\tAbility to obtain national police clearance certificate for work at mine sites;\n•\tAbility to pass ongoing Pre-employment medical assessments including drug and alcohol tests for site access.\n\nSalary offer:  The annual salary for this position is $90,000 plus superannuation.\n\nWhat we offer\n\nAs part of a truly global company, you will have the ability to grow and learn in a diverse, collaborative culture. We foster relationships and learning through connected global and local teams, promote flexible and diverse career paths and support the development of your knowledge and skills. \n\nYou will be paid a competitive salary, learn from talented individuals across multiple disciplines and be able to thrive in a safe workplace within a collaborative culture. Ignite your career at a place where your distinct potential can find its home.\n\nOur commitment\n\nGroundProbe promotes and fosters a culture of inclusion and Equal Opportunity Employment everywhere we operate. We treat our people and applicants with fairness, dignity, and respect, getting the best of everyone’s contributions.\n\nAll qualified applicants will receive consideration for employment without regard to race, religion, sexual orientation, gender perception or identity, nationality, age, military or veteran, marital or disability status.",
      "posted": "2022-07-21T15:09:12.957Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "GroundProbe Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "WINDSOR",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304307233"
    },
    {
      "title": "Business Process Consultant",
      "description": "Enable is a pure-play ServiceNow consultancy—100% dedicated to the delivery of ServiceNow advisory, consulting and delivery services. With more than 250 consultants in our ServiceNow practice, we’re the most qualified, certified and capable ServiceNow partner in the APJ region.  \n\n  Our focus is enterprise service management, and we have deep knowledge of and experience in digital and business transformation. Enable has dedicated practices in Customer Service Experience, IT Transformation, Employee Service Experience and Integrated Risk Management. We also have Innovation and Organisational Change Management practices that are intrinsic to everything we do.  \n\n  We are headquartered in Australia, with offices in Singapore, Hong Kong, Thailand, Malaysia, and our centre of excellence in India.   \n\n  Role Summary:  \n\n Consulting roles are exciting and challenging - our customer base ranges across all tier 1 industries and sizes. Engagements vary in length from days to months to years. To be successful in this role, you must present excellent communication skills to work with client stakeholders, client teams and Enablers - both local and remote. You should expect to engage with various clients from commercial to enterprise and have the ability to switch context and customers easily. \n\n  Main Responsibilities:  \n\n \n\t Leveraging Business Consulting Practice methodologies and consulting intellectual property to achieve business objectives. \n\t Drive high-level specific process definition, re-engineering, improvement and gap analysis of current/to-be processes. \n\t Preparing and running functional and technical design workshops \n\t Ensuring process-related deliverables to customers are complete, consistent, high quality, on time and deliver valued outcomes. \n\t Ownership for completing, developing, and improving required documentation such as process flow diagrams, solutions designs, as-built documentation, roles/responsibilities, workshop agendas, presentations, and gap analysis reports. \n\t Documenting user stories with acute attention to detail, reviewing with stakeholders, gaining acceptance criteria and managing stories throughout the development lifecycle with local and remote teams. \n \n\n  Skills Matrix:  \n\n \n\t 2 years of demonstrated experience across process consulting, definition and deployment of process improvement and systems analysis on ServiceNow platform. \n\t Requirements gathering, including experience in creating process documentation, solution designs and detailed requirements. \n\t Experience designing process flows for ServiceNow applications \n\t Domain expertise in IT Service Management. \n\t Experience using ServiceNow Agile Development and managing SCRUM calls and Agile processes. \n \n\n  Qualifications & Certifications:  \n\n ·        IT Degree or relevant tertiary education in Computer Science \n\n ·        ServiceNow CSA + CIS ITSM \n\n ·        ITIL Foundation Certified \n\n ·        PMP and/or Agile Scrum certificates",
      "posted": "2022-08-15T11:49:58.337Z",
      "expiry_date": "2022-09-16T00:00:00.000Z",
      "organisation": "Enable Professional Services",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304876905"
    },
    {
      "title": "Technical Support Specialist: Printing",
      "description": "GJS is a dynamic, Australian-owned business headquartered in Revesby and we’re currently looking for an experienced, self-motivated and customer-focused person to join our support team as a Technical Support Specialist in Queensland.\n\nWe have a passion for our people and are proud of our fast-paced, high-energy, team-orientated environment, so to land this role you’ll need to have the following skills:\n\n- Previous experience servicing and supporting digital equipment\n- Background in electronics\n- Valid driver’s licence\n- Excellent verbal communication and customer service skills\n- Highly organised, efficient time management and reliable\n- High attention to detail and quality focus\n- Professional personal presentation\n- Familiarity with Microsoft Office Suite\n\n**Bonus points if you also have**\n\n- Previous experience within the digital printer market\n- Familiarity with Salesforce Service Cloud/Field Service Lightning\n- Familiarity with SAP Business One\n- Familiarity with Adobe Creative Suite of graphics software\n\nWhat you’ll be doing each day:\n- Providing remote and/or on-site technical support to ensure GJS customers can enjoy maximum up-time and production\n- Hitting the road and installing new printing equipment\n- Remote and on-site product training for GJS customers\n- On-site scheduled servicing of existing GJS printer install base\n- Assisting the sales and customer services teams in maintaining GJS' exceptional customer service standards\n- Develop and maintain all support and service process documentation and the GJS knowledgebase\n\nThe perks!\n-  Competitive salary and benefits\n-  Work for a funky, dynamic business that embraces new technology and is disrupting its industry\n- Young management with progressive ideas\n- All product training provided\n- Immediate start\n\nWorking Hours:\n- Monday to Friday: 8am?4.30pm\n\nGJS is a fun, supportive and equal opportunity employer where we are giving the right person the opportunity to be trained, learn about our exciting industry and become part of our vibrant, energetic and growing team.\n\nHow to apply:\nIf this is you, then please submit a copy of your CV with an accompanying cover letter detailing how your professional experience makes you the best choice for this role and also answers the following questions:\n\n- If you were a cocktail, what would you be and why?\n\nOnly applications with accompanying cover letters that answer the above questions will be considered.\n\nSalary: $50,000.00 – $65,000.00 per year + vehicle allowance",
      "posted": "2022-08-04T11:52:43.463Z",
      "expiry_date": "2022-09-05T00:00:00.000Z",
      "organisation": "GJS GROUP AUSTRALIA PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "BRISBANE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859779"
    },
    {
      "title": "DevOps Engineer",
      "description": "Responsibilities include:\n•\tSolve complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks. \n•\tWrite/maintain code for custom infrastructure services \n•\tDesign machine learning systems and self-running artificial intelligence (AI) software to automate predictive models. \n•\tDesign, review, and present technical infrastructure solutions to solve business use cases \n•\tWork with clients to gather and documents technical requirements\n•\tDocument and showcase technical features or fixes \n•\tTransform data science prototypes and applying appropriate ML algorithms and tools. \n\nWork experience required  \n•\tSkilled in Python (Programming Language), C++, Java, Microsoft Products, and .NET Framework. \n•\tStrong software engineering skills \n•\tSuperb analytical and problem-solving abilities. \n•\tStrong DevOps skills (preferably with Microsoft Azure Devops)\n•\tGreat communication and collaboration skills. \n•\tExcellent time management and organisational abilities. \n•\tStrong cloud skills (preferably with Microsoft Azure) \n•\tDocumentation skills\n•\tExperience working in an Agile environment \n\nSalary $80,000 - $100,000 p/a\nPermanent Position\nLocation – Melbourne remote",
      "posted": "2022-08-11T10:44:35.213Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871731"
    },
    {
      "title": "Node/React Developer",
      "description": "Milestone IT is a recognised leader in the recruitment and employment of high-quality software engineers. Right now, we have an exciting opportunity for an experienced developer to join our team. \n\nAbout you\nApplicants must be able to demonstrate the following key capabilities and behaviours:\nStrong JavaScript (ES6/7) development experience with ReactJS and NodeJS. \nPrior experience with databases (e.g. MySQL, Postgres)\nPrior experience with GraphQL development experience is a plus.\nPrior experience with any message-queueing (e.g. RabbitMQ, Kafka)\nPrior experience with a JavaScript testing framework such as Jest.\nPrior experience with microservices architectures and containerisation, including good knowledge of Docker.\nStrong critical thinking skills, an analytical mindset and outstanding attention to detail.\nAbility to work efficiently with remote teams using collaboration technology.\nAbility to identify issues and solve complex problems as part of a team.\nAbility to remain calm when under pressure and meet demanding deadlines.\nGood written and verbal communication skills.\nA proactive approach to resolving problems.\nKnowledge of agile software development lifecycles (SDLC) and experience working on projects that follow an Agile Scrum methodology.\nKnowledge of proper source code management and the use of Git repositories.",
      "posted": "2022-08-18T11:56:07.523Z",
      "expiry_date": "2022-09-19T00:00:00.000Z",
      "organisation": "MILESTONE INFORMATION TECHNOLOGY PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "DOCKLANDS",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304884356"
    },
    {
      "title": "Technical Lead - Performance",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to lead a team in our Careers camp working on our Performance product. This camp has multiple teams tasked with creating transformative people-first performance reviews that are growth focussed, fair and equitable, and inspire action. Captured in a platform that is easy to use, connected and scalable.\n\nYour role will be to provide confident technical and people leadership, empowering and enabling your engineers to achieve a high standard of technical excellence. You will be working both hands-on and hands-off, guiding outcomes that align towards our technical vision, coaching the team towards robust system architecture, their technology choices, implementation details, and product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team to craft and share compelling solutions with peers and stakeholders\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously led a high performance engineering team and worked closely with other leaders\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate and draw intelligent conclusions\nExperience working across the stack and not perturbed by legacy systems\nYou are...\n\nAn empathetic people leader who can naturally balance hands-on tasks and coaching individuals\nA passionate supporter of high quality, scaleable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:49:11.290Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198775"
    },
    {
      "title": "Systems Support Consultant ",
      "description": "Systemnet is an unique IT infrastructure services company based in Sydney. \nSystemnet, together with our partners, are dedicated to providing our clients with an effective, efficient and responsive outsourced IT infrastructure service and innovative solutions. \n\nSystemnet prides itself with the relationships it has fostered over the last 25 years with its clients, suppliers and team members. We aim to provide you with a challenging and rewarding environment, in which you may develop your professional skills and simultaneously enhance the success of Systemnet, its team and our clients. \n\nSystemnet is not product centric and will evaluate all options when recommending solutions to our clients. This creates an opportunity for you to explore new ideas and introduce these new solutions to the business.\n\nAbout the role: \n\nThe focus is on business IT systems and the responsibilities include design, implementation, maintenance and support of Local Area and Wide Area networks.\n\nYou will:\n\nProvide Managed IT Services to corporate clients across a broad range of industry sectors. Your support will be offered remotely and onsite.\nYou will be working on exciting implementation projects which will involve ‘on premises’ and/or cloud installations and migrations.\nDesign new LAN and WAN IT system configurations.\nResearch and utilising your analytical skills evaluate the performance of operational environments with the objective of improving performance, security and redundancy.\nDocument and enforce Systemnet standards.\nMaximise network performance by monitoring performance and troubleshooting problems and outages on the local and wide area network.\nUsing Network monitoring and analysis tools from SolarWinds use your skills and experience to identify, evaluate and resolve issues quickly and efficiently,\nSchedule and manage system software upgrades and patch management of core devices.\nUtilising multiple sources for information, investigate and resolve network faults while communicating the status of the issues to the client and internal management.\nSecure network systems by establishing and enforcing security policies and implementation of security devices and software.\nMonitor, administer, upgrade and configure firewall environments.\nMonitor and ensure firmware on wide area network devices are up to date.\nManage a configuration of 60+ firewall clusters dispersed across the Asia Pacific region.\nConfiguration of routers and switching equipment for voice and data services.\nTelephone and on-site support/troubleshooting for customers and other Systemnet engineers.\nRemote technical support to local and international clients.\nHardware & Software Support\nLiaise with project managers, sales consultants, IT software and hardware vendors in order to deliver cost effective IT solutions.\nClient systems management\n\nBenefits and perks:\n\nGreat learning and career development opportunities\nInner city working environment\nTeam-focused environment\nFlexibility, eg working from home on certain days\n\nSkills and experience:\n\nIt is essential that you have excellent English oral and written communication skills.\nYou will need to be able to provide both remote and onsite support.\nYou must be able to interact confidently at all levels within an organisation.\nIT experience or relevant IT qualifications\nWorked with Server platforms\nKnowledge of Server Virtualisation technologies from Microsoft and VMWare\nFamiliarity with Cloud technologies such as Office 365, Azure and AWS\nWorked with disaster recovery products such as Veeam\nKnowledge of security technologies from vendors such as Watchguard and Cisco\nFamiliarity with all the usual network infrastructure technologies such as routers, switches, and Wi-Fi\nWillingness and ability to participate in a 24x7 phone support roster.\nYou will also need to have a valid visa to work and live in Australia",
      "posted": "2022-08-11T13:57:55.787Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "SYSTEMNET PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Eastern Sydney",
      "area": "BONDI JUNCTION",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872407"
    },
    {
      "title": "Desktop Support Engineer",
      "description": "Daily Mail Australia forms part of a phenomenal global offering attracting over 250 million readers world-wide across our award-winning newspapers, websites and apps - making it the world's largest English-speaking news website. We are consistently breaking exclusives in local and global news, celebrity, entertainment and sport while reporting on what's trending in fashion, beauty, health and technology.\n\nWe are looking for a Desktop Support Engineer to join our four-person team based in Sydney. You will act as the first point of contact for all technical related queries for all company users and apply your knowledge, logic and research techniques to solve technical issues. \n\nThe successful candidate will work remotely but there may be occasional travel required. \n\n\nKey Responsibilities:\n\nProviding 1st/2nd line support for onsite/remote users\nAnswering walk-ups, phone queries and emails from staff at all levels of the business\nSupporting VIP users including the Managing Editors office and the Editor\nAdministration of all company IT equipment including laptops, desktops and mobile devices\nAsset management of all company IT equipment\nEnsuring support team SLA’s are achieved\nUser account creation and access/role management\nBuild management, imaging and software deployments via SCCM 2012 and Jamf Pro\nLiaising with our global Tech teams to provide a high level of service to end users\nInvestigating and analysing incidents through to root cause\nEnsuring internal Daily Mail applications achieve maximum uptime, availability and performance\nProviding support and training of both bespoke and off the shelf applications\nMonitoring and implementing IT security policies\nDeploying/upgrading hardware and software as required\nMaintaining a strong working relationship with all external partners, vendors and internal teams\nMaintaining working knowledge of all computer related systems and software to facilitate troubleshooting and repairs\nCreation and management of technical documentation\nKeeping abreast of new computer-related technology that will assist Daily Mail Australia\nAttending training courses when required to do so\nManaging your time effectively under pressure\nPerforming other related duties as required\n\nKey Skills/Qualifications\n\nHardware/software installation and troubleshooting\nRemote support software (TeamViewer, LogMeIn, Splashtop, VNC)\nDemonstrable experience with supporting Windows and macOS operating systems\nExperience with ticket triaging and strong understanding of ticket management processes\nExperience working with Microsoft technologies (O365, Teams, SharePoint, OneDrive, Azure and Exchange)\nActive directory administration via Quest ActiveRoles Server/Azure AD\nSCCM 2012 image/software deployment\nExperience with Apple MDM tools (Jamf Pro)\nExperience with identity and access management solutions\nFTP software including Filezilla and SmartFTP\nBasic networking skills – TCP/IP, DNS, DHCP, VPNs\nExcellent documentation skills\nStrong written and oral communication skills and a keen attention for detail\n\nDesirable: \n\nExperience with Linux/Ubuntu operating systems\nMS security products (InTune, Defender, ATP)\nZendesk/Service Now ticketing systems\nAtlassian products (Jira/Confluence)\nVirtualisation technologies including VMWare, Parallels and Oracle VM Virtual Box\nExperience with CDN management (AWS/Akamai)\nHTML/CSS/SQL/Bash/Python\nUnderstanding of ITIL/Agile methodologies\n\nAnnual Base Salary between: $60,000 to $70,000 + Super",
      "posted": "2022-08-11T15:13:51.783Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "DAILYMAIL.COM AUSTRALIA PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872802"
    },
    {
      "title": "DevOps Engineer - Developer Platform  - Open to Remote across ANZ",
      "description": "At Canva, we’re transforming the way the world designs. Canva's user base has grown by over 10x over the last 2 years, and serves millions of users every single month, in over 100 languages, and across web and mobile platforms.  In order to ensure high availability, top-notch performance, and the continued scalability of the environment as Canva grows, we've decided to grow our Infrastructure Group.  We're seeking self-motivated and talented engineers to join us. \n\n   \n\n Stable, scalable, and well-maintained systems are the foundations of our development and design processes.  The developer efficiency team’s mission is to empower any engineer to develop and ship awesome features with the highest efficiency and quality.  We do this by building infrastructure tools and processes that facilitate the entire development life-cycle.  This includes our CI systems, build tools, IDE workflows, source control, and more.  The mission of this role is to maintain and improve our internal tools so that developers working at Canva have a delightful developer experience. \n\n   \n\n Responsibilities \n\n \n\t Work to improve/maintain internal developer experience platforms that empower engineers to work efficiently. \n\t Work across CI, Static Analysis Tooling, IDE Integration (Bazel) and other developer-related domains as necessary to ensure Canva’s engineering teams continue to scale with the demands of the product suite \n\t Develop self-service infrastructure from the ground up to empower our engineering teams to work more efficiently \n\t Communicate with other teams to figure out the best solutions to their problems \n\t Participate in design meetings, interviews, and code reviews \n\t Propose new approaches and solutions to ensure we future-proof Canva's distributed cloud infrastructure as we scale up \n\t Be invariably passionate about performance debugging, benchmarking, building awesome things, and picking up new technologies and skills \n \n\n Required Experience \n\n \n\t As a DevOps/ Software Engineer, have experience building internal tooling for CI, infrastructure, or developer efficiency/productivity \n\t Advanced coding proficiency in Python/ Java/golang  \n\t Experience with containers, Docker, Kubernetes \n\t An understanding of the DevOps ecosystem concerning tooling, Continuous Delivery, Continuous Integration, Infrastructure as Code \n\t Experience working in Linux cloud-based services in AWS, Google Cloud, or Azure \n\t Excellent verbal and written communication skills; strong soft skills when managing both technical and non-technical stakeholders \n\t Be self-motivated with a strong sense of ownership over complex problems and their related solutions",
      "posted": "2022-08-11T10:23:21.450Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Canva",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SURRY HILLS",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871636"
    },
    {
      "title": "Support Engineer",
      "description": "About the Company:\n5G Networks (5GN) is a licenced telecommunications carrier operating across Australia. Our vision is to be Australia’s partner of choice for unifying a seamless digital experience for our customers across data connectivity, cloud and data centre services, all underpinned by our expert managed services.\n\nThe Role\nAs a Support Engineer you will be responsible for providing fault resolution, escalation and maintenance services to our customers. Supporting them both onsite and remotely, you will install and maintain computer hardware, software and networks. Using your ability to develop relationships across the organisation, you'll provide support to clients across a wide range of platforms and technologies.\n\nWe are a lean and mean local team so you'll be working at full tilt most of the time, but you'll have a new challenge every day and will be a part of a national team of 100+ engineers.\n\nTitle: Support Engineer\nOccupation: ICT Support Engineer\nSalary: $65,000 - $79,999 (depending on experience) plus super \nCompany: Webcentral\nLocation: Melbourne\nHours: Full time 38 hours per week\nExperience Required: min 2 years in relevant role\nVisa Sponsorship: Nomination for temporary work visa and/or Permanent Residency will be considered for eligible candidates.\nDuties: Some of the duties you will be required to perform include\n•\tAssisting with fault escalation and resolution.\n•\tContribute to the delivery and documentation of customer projects.\n•\tConfigure, deploy and administer LAN, WAN, security and remote access technologies.\n•\tSupport customers with a wide variety of platforms and technologies.\n•\tBuild and configure desktops, servers and storage networking hardware.\n•\tProvide exceptional customer service.\n\nPLEASE NOTE: Only successful candidates will receive a reply. Applicants who contact the employer directly or submit applications outside of this online portal will not be considered.",
      "posted": "2022-08-09T16:37:27.383Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "George Migration Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868687"
    },
    {
      "title": "Technical Lead",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to support and grow our an Engineering Team, which sits within one of our Engineering Camps.\n\nYour role will be to help nurture and grow skilled engineers by coaching, mentoring and supporting your engineers. You will be working both hands-on and hands-off, with our technical vision as your target. You will coach your team to create world-class system architecture, make smart technology choices and deliver best-in-class product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team in crafting compelling solutions\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously helped lead a high performance engineering team\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate large or complex problems and decompose into smaller iterable components\nYou are...\n\nAn empathetic technical leader who can naturally balance hands-on tasks and coaching individuals\nAn avid supporter of high quality, scalable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:48:09.517Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198774"
    },
    {
      "title": "Business Analyst",
      "description": "Responsibilities:\n\nAnalyse and derive insights into current and future billing and pricing items within an End User Compute environment.\nProactively socialise with stakeholder groups and and assist with the development of strategies for optimisation/ consolidation, of price points and billing functionalities.\nProactively work with stakeholder groups billing strategies.\nEvaluate business processes, anticipate requirements, uncover areas for improvement, and develop and implement solutions.\nLead ongoing reviews of business processes and develop optimization strategies.\nAssist in Request For Proposal (RFP) Costing Analysis and supporting Business Case modelling\nDevelop policies, procedures and pricing tools for billing functionalities\nInput into the areas related to Asset & Billing\nCreation of detailed Modelled reporting to present to key stakeholders on pricing impacts.\n\n\n\n\nRequirements:\n\nA bachelor’s degree in business, technology or related field or equivalent experience.\nExceptional analytical and conceptual thinking skills.\nThe ability to influence stakeholders and work closely with them to determine acceptable solutions.\nExcellent documentation skills.\nFundamental analytical and conceptual thinking skills.\nExperience creating detailed reports and giving presentations.\nCompetency in Microsoft applications including Word, Excel, and Outlook.\nA track record of following through on commitments.\nExcellent planning, organisational, and time management skills.\nA history of supporting successful projects.\n\nLocation - Melbourne remote\nPermanent position",
      "posted": "2022-08-09T15:39:41.807Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868351"
    },
    {
      "title": "Software Engineering Manager  - Design Import, Remote AU/NZ",
      "description": " Software Engineering Manager (backend) - Design Import, Remote AU/NZ Sydney, New South Wales, Australia / Engineering - Leadership / Full-time Apply...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-08-02T17:00:07.300Z",
      "expiry_date": "2022-08-24T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304828305"
    },
    {
      "title": "Integration Engineer - Remote - Permanent",
      "description": " Integration Engineer at exciting start-up - Remote - Permanent    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.        Your new role:   \n \n Lead the development of complex software integrations end-to-end \n Analyse and model data architecture \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n      \n What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Significant experience working with .NET, Python, Typescript & Go \n Understanding of modern integration patterns utilised with Serverless, Event \n Driven systems. \n Integration platforms e.g. Boomi, MuleSoft, Jitterbit \n Database experience e.g. Oracle, MS SQL or MongoDB \n Integration Engineer 3 \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:07:02.363Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859375"
    },
    {
      "title": "Tech Lead - ANZ - Oceania",
      "description": "KEY DUTIES/RESPONSIBILITIES:\n\nAs a Site Tech Leader, you must be able to lead and provide guidance and supervision to technical support team members from different countries based in Australia, Indonesia, Japan and South Korea and New Zealand as a dispatch site. Strong leadership and communication skills.Strong technical skills supporting user environment, desktop, servers and networking.Must be able to work in a fast phase environment of diverse cultures.Able to work with remote teams based in India, US and Europe providing level 3 support in EUC, Servers and Networking to Oceania businesses.\n\nRoles & Responsibilities\n\nProvide technical support as a point of contact for IT for the site.\nEnd-user desktop, laptops, office IT with smart hand support for network and servers.\nInstallation support for various software on end-user systems and servers when required\nNew users onboarding preparing IT assets and tools.\nOffboarding support, collecting IT assets and sanitizing IT assets and keep in stock.\nExecutive / VIP support.\nCoordination and remote hand support to backend team for Network & server smart hand support.\nIP phone, Video conference support, Level 1 Multifunction Printers support.\nCoordinate external vendors when engaged for support.\nWork independently and coordinate in-house IT projects.\nThe engineer should manage most of their time around activities involving BAUs - SLAs, CSAT, Response Time to Client, Average Resolution time, Open incident backlog and maintaining SOP’s and Runbooks for global team use\nShould provide technical guidance to Site Tech, prioritization on workload and resource capacity planning\nShould be leading the project support team\nAsset / stock management / E-Waste, Site Tech Onboarding / Training / Process alignment / Documentation , Onsite Training / User Education , Vendor Co-ordination\nSelf-disciplined and highly motivated.\nGood decision-making skills \nShould be able to prioritise workload based on SLA’s and user impact. \nConfiguring, deploying, and troubleshooting enterprise and personal desktop and laptop computers, personal productivity devices, and business applications.\nSupporting midrange servers.\nSupporting network devices such as switches, routers, and Wireless Apps with the help of the backend team.\nHanding tickets on ServiceNow or a similar ticketing system.\nTroubleshooting VPN.\nApplication support with Microsoft Office (Outlook, Word, Excel, and PowerPoint) and SharePoint.\nTroubleshooting MS Windows 10.\nTroubleshooting MS Office 365 issues for end-users.\nOffice IT Asset Management.\nDESIRED SKILLS & EXPERIENCE\n\n 7+ years experience in IT supports demonstrating increasing responsibility and technical expertise in a corporate enterprise environment.\nIn-depth knowledge of Microsoft Windows 7 and Windows 10 operating systems and their related remote access.\nKnowledge & experience with ServiceNow or similar ticketing system.\nUnderstanding of Active Directory.\nFamiliarity with Microsoft server technologies and their associated user management tools, including Active Directory, Office 365, SharePoint, File, Print, DHCP, and DNS.",
      "posted": "2022-07-20T12:01:52.360Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "AVASO Technology Solutions Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Northern Sydney & Central Coast",
      "area": "LANE COVE NORTH",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304248995"
    },
    {
      "title": "Full-Stack Developer - Remote",
      "description": " Full-Stack Developer - Remote - FinTech    We are currently partnering with an exciting FinTech startup who specialise in the construction of booking engines and online payments, as well as digital marketing. The company offer an exciting culture with an array of employee benefits, and the successful candidate will be working in a dynamic environment contributing to the rapid growth of an exciting start-up.      Your new role:   \n \n Lead the development of full-stack applications from design through to production release \n Connect platforms through API orchestration to improve on customer experience \n Manage best-practice development to ensure secure, reliable and predictable outcomes \n Champion project success through collaboration, support, and a positive attitude \n \n     What you'll need to succeed:   \n \n Strong understanding of end-to-end development of modern integration solutions within cloud-native environments e.g. GCP, AWS, Azure etc. \n Experience problem-solving and analysing \n Front-end experience with Typescript, JavaScript, HTML \n Significant experience working with server-side languages e.g. .NET, Python, Typescript & Go \n Frameworks such as React, Vue or Svelte \n Familiarity with API Development and database experience e.g. Oracle, MS SQL or MongoDB \n Experience with CI/CD and Infrastructure as code \n Previously worked within Agile environments \n \n      SA Licence number :  LHS 297508  Please  click here  to apply. ",
      "posted": "2022-08-04T10:43:04.580Z",
      "expiry_date": "2022-09-03T00:00:00.000Z",
      "organisation": "Marcusmcasx Castle",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859515"
    },
    {
      "title": "Senior Software Engineer  - Open to remote across ANZ",
      "description": " Senior Software Engineer (Python) - Open to remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure / Full-time Apply for...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-30T19:55:05.793Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304676771"
    },
    {
      "title": "Senior Software Engineer  - AWS / Terraform / DevOps ",
      "description": " Senior Software Engineer (Python / Golang) - AWS / Terraform / DevOps (remote) Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-21T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304711028"
    },
    {
      "title": "Software Engineer  - AWS/Kubernetes/Devops - Open for Remote across ANZ",
      "description": " Software Engineer (Python) - AWS/Kubernetes/Devops - Open for Remote across ANZ Sydney, New South Wales, Australia / Engineering - Infrastructure /...    Company:  Canva     Location:  Sydney Region - Sydney NSW.    View more detail / apply  ",
      "posted": "2022-07-31T19:55:06.237Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304741192"
    },
    {
      "title": "Full Time Computer Network and Systems Engineer",
      "description": "Business name: ONCALL Language Services Pty Ltd\nBusiness Address: Level 2, 150 Albert Road, South Melbourne, VIC – 3205\n\nPosition Title: Full Time Computer Network and Systems Engineer\nSalary: $62,000 plus superannuation \n\nTasks include:\n\n•\tInvestigate, troubleshoot, maintain and control the use of networks (LAN/WAN), servers, workstations, and peripheral devices. \n•\tInvestigate, install, configure, test and upgrade hardware and software applications, including network equipment. \n•\tInstall, configure, maintain and control Network Printers and Scanners, Routers and Switches for the smooth business operation.\n•\tDaily monitor and control performances of computer systems and networks.\n•\tInstall, implement and monitor network traffic and security \n•\tProvide necessary support by installing, configuring and providing support for Remote access to the team.\n•\tProvide remote/onsite troubleshooting and resolving the issues to internal office staffs and clients as per necessity.\n•\tWork together with the team to evaluate and resolve daily issues.\n•\tMonitor and control the use of email, web navigation and installed software applications.\n•\tInstall, configure, maintain and monitor routine backup of servers, virtual machines and databases.\n•\tMonitor Firewalls, Routers, Switches, Access points and Cabling for smooth operation of business\n•\tAdministration and management of servers, VMs, workstations and other software applications.\n•\tPrepare and maintain the procedure and documentation for network inventory and recording IT and network incidents, their diagnosis and resolutions.\n•\tProvide critical analysis and problem-solving suggestions to the team, clients and interpreters whenever required.\n•\tParticipate, provide critical analysis and contribute in various IT projects.\n•\tInstall, test, monitor, and pack interpreting equipment and transport the equipment and booths.\n•\tResponsible for keeping interpreting equipment clean, safe and organised.\n\nSkills Required:\n•\tRelevant Bachelors or Master Degree \n•\tMinimum three years of relevant work experience\n•\tDeep understanding in Wire and Wireless controllers, Access points, WPA2,\n•\tProven experience working in a Systems Administration Assitant / Level 2 Support role preferably within an MSP environment\n•\tAdvanced knowledge of Active Directory, Group Policies, DNS, DHCP and Windows 2012 through 2019\n•\tExperience in Office 365, Azure and AWS administration is desirable.\n•\tExcellent knowledge of Networking technologies (switching, routing, VLAN, WLAN, WAN, VPN)\n•\tMaintaining software updates and version consistency\n•\tExperience handling large conferences is an added advantage \n•\tKnowledge in Wireless and Infrared technologies and equipments\n•\tExcellent Hands -on knowledge of virtualization is essential (VMware, HyperV, Vsphere preferred)\n•\tExperience with VOIP tools, online teplohny system (3CX preferred)\n•\tExperience in firewall both hardware and software (pfsense prefrred)\n•\tExcellent troubleshooting and resolving ability\n•\tExperience in regular back up of VMs and Online applications (VEEAM and Handy backup – preferred)\n\n\nPlease send your CV to info@businessnest.com.au",
      "posted": "2022-08-11T11:23:21.043Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Business Nest",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "SOUTH MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871870"
    },
    {
      "title": "Field Technician",
      "description": "The Field Technician is a company representative at various Client sites within the Australasia region providing training and technical expertise, maintenance and repairs and support of GroundProbe’s products both locally and globally in surface and underground mining environments.\n\nResponsibilities\n1.\tWork safely, and with regard to the safety of others, including: \na.\tCompliance with all WHS policies and procedures, and\nb.\tActively work to improve safety in the workplace\n2.\tInstall and integrate GroundProbe’s products as required for Customers;\n3.\tCommission and decommission GroundProbe’s products;\n4.\tOrganise and perform external demonstrations on GroundProbe’s products;\n5.\tFollow up on demonstrations to ensure successful outcome for Customers and GroundProbe;\n6.\tTrain technical specialist team on deployment, operation and maintenance of GroundProbe’s products;\n7.\tManage few customer accounts with technical and operational aspect and build strong relationship with customer\n8.\tMonitor and present GroundProbe’s products data;\n9.\tProvide on-site training and technical support to Customers;\n10.\tMaintain GroundProbe’s products minimising downtime and meeting Customer needs;\n11.\tPerform technical support work on GroundProbe technologies at remote sites and from GroundProbe’s office;\n12.\tAssist with marketing and development of a positive image of GroundProbe, its technologies and its employees.\n\nQualifications\n•\tTertiary qualifications or relevant experience in Electrical, Mechanical or Electronic discipline(s);\n•\tExtensive relevant technical work experience in a customer service based organisation;\n•\tExperience in electronics, radar, telecommunications or a related field;\n•\tExperience, proven potential, or a track record of success in a comparable role, doing comparable work.\n•\tAbility to train individuals and small groups;\n•\tMechanical knowledge is desirable.\n•\tMining environment/remote location experience is desirable;\n•\tComputer literacy especially in MS Office;\n•\tUnencumbered Manual Drivers Licence;\n•\tAbility to obtain national police clearance certificate for work at mine sites;\n•\tAbility to pass ongoing Pre-employment medical assessments including drug and alcohol tests for site access.\n\nSalary offer:  The annual salary for this position is $90,000 plus superannuation.\n\nWhat we offer\n\nAs part of a truly global company, you will have the ability to grow and learn in a diverse, collaborative culture. We foster relationships and learning through connected global and local teams, promote flexible and diverse career paths and support the development of your knowledge and skills. \n\nYou will be paid a competitive salary, learn from talented individuals across multiple disciplines and be able to thrive in a safe workplace within a collaborative culture. Ignite your career at a place where your distinct potential can find its home.\n\nOur commitment\n\nGroundProbe promotes and fosters a culture of inclusion and Equal Opportunity Employment everywhere we operate. We treat our people and applicants with fairness, dignity, and respect, getting the best of everyone’s contributions.\n\nAll qualified applicants will receive consideration for employment without regard to race, religion, sexual orientation, gender perception or identity, nationality, age, military or veteran, marital or disability status.",
      "posted": "2022-07-21T15:09:12.957Z",
      "expiry_date": "2022-08-22T00:00:00.000Z",
      "organisation": "GroundProbe Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "WINDSOR",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304307233"
    },
    {
      "title": "Business Process Consultant",
      "description": "Enable is a pure-play ServiceNow consultancy—100% dedicated to the delivery of ServiceNow advisory, consulting and delivery services. With more than 250 consultants in our ServiceNow practice, we’re the most qualified, certified and capable ServiceNow partner in the APJ region.  \n\n  Our focus is enterprise service management, and we have deep knowledge of and experience in digital and business transformation. Enable has dedicated practices in Customer Service Experience, IT Transformation, Employee Service Experience and Integrated Risk Management. We also have Innovation and Organisational Change Management practices that are intrinsic to everything we do.  \n\n  We are headquartered in Australia, with offices in Singapore, Hong Kong, Thailand, Malaysia, and our centre of excellence in India.   \n\n  Role Summary:  \n\n Consulting roles are exciting and challenging - our customer base ranges across all tier 1 industries and sizes. Engagements vary in length from days to months to years. To be successful in this role, you must present excellent communication skills to work with client stakeholders, client teams and Enablers - both local and remote. You should expect to engage with various clients from commercial to enterprise and have the ability to switch context and customers easily. \n\n  Main Responsibilities:  \n\n \n\t Leveraging Business Consulting Practice methodologies and consulting intellectual property to achieve business objectives. \n\t Drive high-level specific process definition, re-engineering, improvement and gap analysis of current/to-be processes. \n\t Preparing and running functional and technical design workshops \n\t Ensuring process-related deliverables to customers are complete, consistent, high quality, on time and deliver valued outcomes. \n\t Ownership for completing, developing, and improving required documentation such as process flow diagrams, solutions designs, as-built documentation, roles/responsibilities, workshop agendas, presentations, and gap analysis reports. \n\t Documenting user stories with acute attention to detail, reviewing with stakeholders, gaining acceptance criteria and managing stories throughout the development lifecycle with local and remote teams. \n \n\n  Skills Matrix:  \n\n \n\t 2 years of demonstrated experience across process consulting, definition and deployment of process improvement and systems analysis on ServiceNow platform. \n\t Requirements gathering, including experience in creating process documentation, solution designs and detailed requirements. \n\t Experience designing process flows for ServiceNow applications \n\t Domain expertise in IT Service Management. \n\t Experience using ServiceNow Agile Development and managing SCRUM calls and Agile processes. \n \n\n  Qualifications & Certifications:  \n\n ·        IT Degree or relevant tertiary education in Computer Science \n\n ·        ServiceNow CSA + CIS ITSM \n\n ·        ITIL Foundation Certified \n\n ·        PMP and/or Agile Scrum certificates",
      "posted": "2022-08-15T11:49:58.337Z",
      "expiry_date": "2022-09-16T00:00:00.000Z",
      "organisation": "Enable Professional Services",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304876905"
    },
    {
      "title": "Technical Support Specialist: Printing",
      "description": "GJS is a dynamic, Australian-owned business headquartered in Revesby and we’re currently looking for an experienced, self-motivated and customer-focused person to join our support team as a Technical Support Specialist in Queensland.\n\nWe have a passion for our people and are proud of our fast-paced, high-energy, team-orientated environment, so to land this role you’ll need to have the following skills:\n\n- Previous experience servicing and supporting digital equipment\n- Background in electronics\n- Valid driver’s licence\n- Excellent verbal communication and customer service skills\n- Highly organised, efficient time management and reliable\n- High attention to detail and quality focus\n- Professional personal presentation\n- Familiarity with Microsoft Office Suite\n\n**Bonus points if you also have**\n\n- Previous experience within the digital printer market\n- Familiarity with Salesforce Service Cloud/Field Service Lightning\n- Familiarity with SAP Business One\n- Familiarity with Adobe Creative Suite of graphics software\n\nWhat you’ll be doing each day:\n- Providing remote and/or on-site technical support to ensure GJS customers can enjoy maximum up-time and production\n- Hitting the road and installing new printing equipment\n- Remote and on-site product training for GJS customers\n- On-site scheduled servicing of existing GJS printer install base\n- Assisting the sales and customer services teams in maintaining GJS' exceptional customer service standards\n- Develop and maintain all support and service process documentation and the GJS knowledgebase\n\nThe perks!\n-  Competitive salary and benefits\n-  Work for a funky, dynamic business that embraces new technology and is disrupting its industry\n- Young management with progressive ideas\n- All product training provided\n- Immediate start\n\nWorking Hours:\n- Monday to Friday: 8am?4.30pm\n\nGJS is a fun, supportive and equal opportunity employer where we are giving the right person the opportunity to be trained, learn about our exciting industry and become part of our vibrant, energetic and growing team.\n\nHow to apply:\nIf this is you, then please submit a copy of your CV with an accompanying cover letter detailing how your professional experience makes you the best choice for this role and also answers the following questions:\n\n- If you were a cocktail, what would you be and why?\n\nOnly applications with accompanying cover letters that answer the above questions will be considered.\n\nSalary: $50,000.00 – $65,000.00 per year + vehicle allowance",
      "posted": "2022-08-04T11:52:43.463Z",
      "expiry_date": "2022-09-05T00:00:00.000Z",
      "organisation": "GJS GROUP AUSTRALIA PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "QLD - Brisbane & Gold Coast - Brisbane & Surrounds",
      "area": "BRISBANE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304859779"
    },
    {
      "title": "DevOps Engineer",
      "description": "Responsibilities include:\n•\tSolve complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks. \n•\tWrite/maintain code for custom infrastructure services \n•\tDesign machine learning systems and self-running artificial intelligence (AI) software to automate predictive models. \n•\tDesign, review, and present technical infrastructure solutions to solve business use cases \n•\tWork with clients to gather and documents technical requirements\n•\tDocument and showcase technical features or fixes \n•\tTransform data science prototypes and applying appropriate ML algorithms and tools. \n\nWork experience required  \n•\tSkilled in Python (Programming Language), C++, Java, Microsoft Products, and .NET Framework. \n•\tStrong software engineering skills \n•\tSuperb analytical and problem-solving abilities. \n•\tStrong DevOps skills (preferably with Microsoft Azure Devops)\n•\tGreat communication and collaboration skills. \n•\tExcellent time management and organisational abilities. \n•\tStrong cloud skills (preferably with Microsoft Azure) \n•\tDocumentation skills\n•\tExperience working in an Agile environment \n\nSalary $80,000 - $100,000 p/a\nPermanent Position\nLocation – Melbourne remote",
      "posted": "2022-08-11T10:44:35.213Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871731"
    },
    {
      "title": "Node/React Developer",
      "description": "Milestone IT is a recognised leader in the recruitment and employment of high-quality software engineers. Right now, we have an exciting opportunity for an experienced developer to join our team. \n\nAbout you\nApplicants must be able to demonstrate the following key capabilities and behaviours:\nStrong JavaScript (ES6/7) development experience with ReactJS and NodeJS. \nPrior experience with databases (e.g. MySQL, Postgres)\nPrior experience with GraphQL development experience is a plus.\nPrior experience with any message-queueing (e.g. RabbitMQ, Kafka)\nPrior experience with a JavaScript testing framework such as Jest.\nPrior experience with microservices architectures and containerisation, including good knowledge of Docker.\nStrong critical thinking skills, an analytical mindset and outstanding attention to detail.\nAbility to work efficiently with remote teams using collaboration technology.\nAbility to identify issues and solve complex problems as part of a team.\nAbility to remain calm when under pressure and meet demanding deadlines.\nGood written and verbal communication skills.\nA proactive approach to resolving problems.\nKnowledge of agile software development lifecycles (SDLC) and experience working on projects that follow an Agile Scrum methodology.\nKnowledge of proper source code management and the use of Git repositories.",
      "posted": "2022-08-18T11:56:07.523Z",
      "expiry_date": "2022-09-19T00:00:00.000Z",
      "organisation": "MILESTONE INFORMATION TECHNOLOGY PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "DOCKLANDS",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304884356"
    },
    {
      "title": "Technical Lead - Performance",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to lead a team in our Careers camp working on our Performance product. This camp has multiple teams tasked with creating transformative people-first performance reviews that are growth focussed, fair and equitable, and inspire action. Captured in a platform that is easy to use, connected and scalable.\n\nYour role will be to provide confident technical and people leadership, empowering and enabling your engineers to achieve a high standard of technical excellence. You will be working both hands-on and hands-off, guiding outcomes that align towards our technical vision, coaching the team towards robust system architecture, their technology choices, implementation details, and product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team to craft and share compelling solutions with peers and stakeholders\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously led a high performance engineering team and worked closely with other leaders\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate and draw intelligent conclusions\nExperience working across the stack and not perturbed by legacy systems\nYou are...\n\nAn empathetic people leader who can naturally balance hands-on tasks and coaching individuals\nA passionate supporter of high quality, scaleable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:49:11.290Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198775"
    },
    {
      "title": "Systems Support Consultant ",
      "description": "Systemnet is an unique IT infrastructure services company based in Sydney. \nSystemnet, together with our partners, are dedicated to providing our clients with an effective, efficient and responsive outsourced IT infrastructure service and innovative solutions. \n\nSystemnet prides itself with the relationships it has fostered over the last 25 years with its clients, suppliers and team members. We aim to provide you with a challenging and rewarding environment, in which you may develop your professional skills and simultaneously enhance the success of Systemnet, its team and our clients. \n\nSystemnet is not product centric and will evaluate all options when recommending solutions to our clients. This creates an opportunity for you to explore new ideas and introduce these new solutions to the business.\n\nAbout the role: \n\nThe focus is on business IT systems and the responsibilities include design, implementation, maintenance and support of Local Area and Wide Area networks.\n\nYou will:\n\nProvide Managed IT Services to corporate clients across a broad range of industry sectors. Your support will be offered remotely and onsite.\nYou will be working on exciting implementation projects which will involve ‘on premises’ and/or cloud installations and migrations.\nDesign new LAN and WAN IT system configurations.\nResearch and utilising your analytical skills evaluate the performance of operational environments with the objective of improving performance, security and redundancy.\nDocument and enforce Systemnet standards.\nMaximise network performance by monitoring performance and troubleshooting problems and outages on the local and wide area network.\nUsing Network monitoring and analysis tools from SolarWinds use your skills and experience to identify, evaluate and resolve issues quickly and efficiently,\nSchedule and manage system software upgrades and patch management of core devices.\nUtilising multiple sources for information, investigate and resolve network faults while communicating the status of the issues to the client and internal management.\nSecure network systems by establishing and enforcing security policies and implementation of security devices and software.\nMonitor, administer, upgrade and configure firewall environments.\nMonitor and ensure firmware on wide area network devices are up to date.\nManage a configuration of 60+ firewall clusters dispersed across the Asia Pacific region.\nConfiguration of routers and switching equipment for voice and data services.\nTelephone and on-site support/troubleshooting for customers and other Systemnet engineers.\nRemote technical support to local and international clients.\nHardware & Software Support\nLiaise with project managers, sales consultants, IT software and hardware vendors in order to deliver cost effective IT solutions.\nClient systems management\n\nBenefits and perks:\n\nGreat learning and career development opportunities\nInner city working environment\nTeam-focused environment\nFlexibility, eg working from home on certain days\n\nSkills and experience:\n\nIt is essential that you have excellent English oral and written communication skills.\nYou will need to be able to provide both remote and onsite support.\nYou must be able to interact confidently at all levels within an organisation.\nIT experience or relevant IT qualifications\nWorked with Server platforms\nKnowledge of Server Virtualisation technologies from Microsoft and VMWare\nFamiliarity with Cloud technologies such as Office 365, Azure and AWS\nWorked with disaster recovery products such as Veeam\nKnowledge of security technologies from vendors such as Watchguard and Cisco\nFamiliarity with all the usual network infrastructure technologies such as routers, switches, and Wi-Fi\nWillingness and ability to participate in a 24x7 phone support roster.\nYou will also need to have a valid visa to work and live in Australia",
      "posted": "2022-08-11T13:57:55.787Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "SYSTEMNET PTY LIMITED",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - Eastern Sydney",
      "area": "BONDI JUNCTION",
      "salary_min": 80001,
      "salary_max": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872407"
    },
    {
      "title": "Desktop Support Engineer",
      "description": "Daily Mail Australia forms part of a phenomenal global offering attracting over 250 million readers world-wide across our award-winning newspapers, websites and apps - making it the world's largest English-speaking news website. We are consistently breaking exclusives in local and global news, celebrity, entertainment and sport while reporting on what's trending in fashion, beauty, health and technology.\n\nWe are looking for a Desktop Support Engineer to join our four-person team based in Sydney. You will act as the first point of contact for all technical related queries for all company users and apply your knowledge, logic and research techniques to solve technical issues. \n\nThe successful candidate will work remotely but there may be occasional travel required. \n\n\nKey Responsibilities:\n\nProviding 1st/2nd line support for onsite/remote users\nAnswering walk-ups, phone queries and emails from staff at all levels of the business\nSupporting VIP users including the Managing Editors office and the Editor\nAdministration of all company IT equipment including laptops, desktops and mobile devices\nAsset management of all company IT equipment\nEnsuring support team SLA’s are achieved\nUser account creation and access/role management\nBuild management, imaging and software deployments via SCCM 2012 and Jamf Pro\nLiaising with our global Tech teams to provide a high level of service to end users\nInvestigating and analysing incidents through to root cause\nEnsuring internal Daily Mail applications achieve maximum uptime, availability and performance\nProviding support and training of both bespoke and off the shelf applications\nMonitoring and implementing IT security policies\nDeploying/upgrading hardware and software as required\nMaintaining a strong working relationship with all external partners, vendors and internal teams\nMaintaining working knowledge of all computer related systems and software to facilitate troubleshooting and repairs\nCreation and management of technical documentation\nKeeping abreast of new computer-related technology that will assist Daily Mail Australia\nAttending training courses when required to do so\nManaging your time effectively under pressure\nPerforming other related duties as required\n\nKey Skills/Qualifications\n\nHardware/software installation and troubleshooting\nRemote support software (TeamViewer, LogMeIn, Splashtop, VNC)\nDemonstrable experience with supporting Windows and macOS operating systems\nExperience with ticket triaging and strong understanding of ticket management processes\nExperience working with Microsoft technologies (O365, Teams, SharePoint, OneDrive, Azure and Exchange)\nActive directory administration via Quest ActiveRoles Server/Azure AD\nSCCM 2012 image/software deployment\nExperience with Apple MDM tools (Jamf Pro)\nExperience with identity and access management solutions\nFTP software including Filezilla and SmartFTP\nBasic networking skills – TCP/IP, DNS, DHCP, VPNs\nExcellent documentation skills\nStrong written and oral communication skills and a keen attention for detail\n\nDesirable: \n\nExperience with Linux/Ubuntu operating systems\nMS security products (InTune, Defender, ATP)\nZendesk/Service Now ticketing systems\nAtlassian products (Jira/Confluence)\nVirtualisation technologies including VMWare, Parallels and Oracle VM Virtual Box\nExperience with CDN management (AWS/Akamai)\nHTML/CSS/SQL/Bash/Python\nUnderstanding of ITIL/Agile methodologies\n\nAnnual Base Salary between: $60,000 to $70,000 + Super",
      "posted": "2022-08-11T15:13:51.783Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "DAILYMAIL.COM AUSTRALIA PTY LTD",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SYDNEY",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304872802"
    },
    {
      "title": "DevOps Engineer - Developer Platform  - Open to Remote across ANZ",
      "description": "At Canva, we’re transforming the way the world designs. Canva's user base has grown by over 10x over the last 2 years, and serves millions of users every single month, in over 100 languages, and across web and mobile platforms.  In order to ensure high availability, top-notch performance, and the continued scalability of the environment as Canva grows, we've decided to grow our Infrastructure Group.  We're seeking self-motivated and talented engineers to join us. \n\n   \n\n Stable, scalable, and well-maintained systems are the foundations of our development and design processes.  The developer efficiency team’s mission is to empower any engineer to develop and ship awesome features with the highest efficiency and quality.  We do this by building infrastructure tools and processes that facilitate the entire development life-cycle.  This includes our CI systems, build tools, IDE workflows, source control, and more.  The mission of this role is to maintain and improve our internal tools so that developers working at Canva have a delightful developer experience. \n\n   \n\n Responsibilities \n\n \n\t Work to improve/maintain internal developer experience platforms that empower engineers to work efficiently. \n\t Work across CI, Static Analysis Tooling, IDE Integration (Bazel) and other developer-related domains as necessary to ensure Canva’s engineering teams continue to scale with the demands of the product suite \n\t Develop self-service infrastructure from the ground up to empower our engineering teams to work more efficiently \n\t Communicate with other teams to figure out the best solutions to their problems \n\t Participate in design meetings, interviews, and code reviews \n\t Propose new approaches and solutions to ensure we future-proof Canva's distributed cloud infrastructure as we scale up \n\t Be invariably passionate about performance debugging, benchmarking, building awesome things, and picking up new technologies and skills \n \n\n Required Experience \n\n \n\t As a DevOps/ Software Engineer, have experience building internal tooling for CI, infrastructure, or developer efficiency/productivity \n\t Advanced coding proficiency in Python/ Java/golang  \n\t Experience with containers, Docker, Kubernetes \n\t An understanding of the DevOps ecosystem concerning tooling, Continuous Delivery, Continuous Integration, Infrastructure as Code \n\t Experience working in Linux cloud-based services in AWS, Google Cloud, or Azure \n\t Excellent verbal and written communication skills; strong soft skills when managing both technical and non-technical stakeholders \n\t Be self-motivated with a strong sense of ownership over complex problems and their related solutions",
      "posted": "2022-08-11T10:23:21.450Z",
      "expiry_date": "2022-09-12T00:00:00.000Z",
      "organisation": "Canva",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "NSW - Sydney - City & Inner West",
      "area": "SURRY HILLS",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304871636"
    },
    {
      "title": "Support Engineer",
      "description": "About the Company:\n5G Networks (5GN) is a licenced telecommunications carrier operating across Australia. Our vision is to be Australia’s partner of choice for unifying a seamless digital experience for our customers across data connectivity, cloud and data centre services, all underpinned by our expert managed services.\n\nThe Role\nAs a Support Engineer you will be responsible for providing fault resolution, escalation and maintenance services to our customers. Supporting them both onsite and remotely, you will install and maintain computer hardware, software and networks. Using your ability to develop relationships across the organisation, you'll provide support to clients across a wide range of platforms and technologies.\n\nWe are a lean and mean local team so you'll be working at full tilt most of the time, but you'll have a new challenge every day and will be a part of a national team of 100+ engineers.\n\nTitle: Support Engineer\nOccupation: ICT Support Engineer\nSalary: $65,000 - $79,999 (depending on experience) plus super \nCompany: Webcentral\nLocation: Melbourne\nHours: Full time 38 hours per week\nExperience Required: min 2 years in relevant role\nVisa Sponsorship: Nomination for temporary work visa and/or Permanent Residency will be considered for eligible candidates.\nDuties: Some of the duties you will be required to perform include\n•\tAssisting with fault escalation and resolution.\n•\tContribute to the delivery and documentation of customer projects.\n•\tConfigure, deploy and administer LAN, WAN, security and remote access technologies.\n•\tSupport customers with a wide variety of platforms and technologies.\n•\tBuild and configure desktops, servers and storage networking hardware.\n•\tProvide exceptional customer service.\n\nPLEASE NOTE: Only successful candidates will receive a reply. Applicants who contact the employer directly or submit applications outside of this online portal will not be considered.",
      "posted": "2022-08-09T16:37:27.383Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "George Migration Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868687"
    },
    {
      "title": "Technical Lead",
      "description": "Join us on our mission to make a better world of work ??\n\nCulture Amp revolutionises how over 25 million employees across 5,000 companies create a better world of work. As the global platform leader for employee experience, we empower companies of all sizes and industries to transform employee engagement, develop high performing teams, and retain talent via cutting-edge research, powerful technology, and the largest employee dataset IN THE WORLD! The most innovative companies across the globe, such as Salesforce, Unilever, PwC, Coles, Slack, and BigCommerce depend on Culture Amp every day.\n\nCulture Amp is backed by 10 years of innovation, leading capital venture funds, and offices in the US, UK, and Australia. We’re recognised as one of the world’s top private cloud companies by Forbes and one of the most innovative workplace companies by Fast Company.\n\nLearn more about how Culture Amp can help you create a better world of work on our website.\n\nHow you can help make a better world of work\n\nWe currently have an opening for a Technical Lead to support and grow our an Engineering Team, which sits within one of our Engineering Camps.\n\nYour role will be to help nurture and grow skilled engineers by coaching, mentoring and supporting your engineers. You will be working both hands-on and hands-off, with our technical vision as your target. You will coach your team to create world-class system architecture, make smart technology choices and deliver best-in-class product quality. As part of this team of amazing humans…\n\nYou will...\n\nBring your passion for innovation and architectural fundamentals to support your team in crafting compelling solutions\nTake accountability for your engineering approach and how your team ships product\nCollaborate closely with your leadership team to improve your team’s performance and deliverables.\nMatch your engineers with opportunities that offer them growth, while fostering a safe and collaborative environment\nYou have...\n\nPreviously helped lead a high performance engineering team\nProven track record in systems design\nExperience engaging with stakeholders\nThe ability to evaluate large or complex problems and decompose into smaller iterable components\nYou are...\n\nAn empathetic technical leader who can naturally balance hands-on tasks and coaching individuals\nAn avid supporter of high quality, scalable architecture\nAn effective communicator both within your team and with external stakeholders \nWe want you to thrive both in and out of work, so we offer...\n\nFully remote working options from anywhere in Australia or New Zealand\nFlexible working schedule to fit in with other commitments\nActive career growth and development support\nHome office budget for remote working\nHighly inclusive workplace with a keen focus on employee well-being\nExcellent parental leave and in work support programme\nComprehensive remuneration package, including share options - making you an owner so you can share in Culture Amp’s success\nA job where you are making a positive difference to millions of people’s lives! ??\nWe believe that inclusive businesses are better, not just for ‘company results’, but for the world. We have a strong commitment to Anti-Racism, and endeavour to lead by example. Every step we make as a business towards anti-racism is another step we can take to support our customers in making a better world (of work). You can see our current commitments to Anti-Racism here.\n\nResearch shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria – unlike the of majority candidates meeting significantly fewer requirements. If this applies to you - we strongly encourage you to apply. ??",
      "posted": "2022-07-19T18:48:09.517Z",
      "expiry_date": "2022-08-20T00:00:00.000Z",
      "organisation": "Culture Amp",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "RICHMOND",
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304198774"
    },
    {
      "title": "Business Analyst",
      "description": "Responsibilities:\n\nAnalyse and derive insights into current and future billing and pricing items within an End User Compute environment.\nProactively socialise with stakeholder groups and and assist with the development of strategies for optimisation/ consolidation, of price points and billing functionalities.\nProactively work with stakeholder groups billing strategies.\nEvaluate business processes, anticipate requirements, uncover areas for improvement, and develop and implement solutions.\nLead ongoing reviews of business processes and develop optimization strategies.\nAssist in Request For Proposal (RFP) Costing Analysis and supporting Business Case modelling\nDevelop policies, procedures and pricing tools for billing functionalities\nInput into the areas related to Asset & Billing\nCreation of detailed Modelled reporting to present to key stakeholders on pricing impacts.\n\n\n\n\nRequirements:\n\nA bachelor’s degree in business, technology or related field or equivalent experience.\nExceptional analytical and conceptual thinking skills.\nThe ability to influence stakeholders and work closely with them to determine acceptable solutions.\nExcellent documentation skills.\nFundamental analytical and conceptual thinking skills.\nExperience creating detailed reports and giving presentations.\nCompetency in Microsoft applications including Word, Excel, and Outlook.\nA track record of following through on commitments.\nExcellent planning, organisational, and time management skills.\nA history of supporting successful projects.\n\nLocation - Melbourne remote\nPermanent position",
      "posted": "2022-08-09T15:39:41.807Z",
      "expiry_date": "2022-09-10T00:00:00.000Z",
      "organisation": "LeadersIT Services Pty Ltd",
      "industry": "Information Tech",
      "work_type": "Full time position",
      "location": "VIC - Melbourne - CBD & Surrounds",
      "area": "MELBOURNE",
      "salary_min": 100000,
      "workforce_url": "https://www.workforceaustralia.gov.au/individuals/jobs/details/2304868351"
    }
  ]
}